export interface FaqData {
  id: number;
  question: string;
  answer: string;
}

export const faqData: FaqData[] = [
  {
    id: 1,
    question: "چگونه می‌توانم از این API استفاده کنم؟",
    answer:
      "برای استفاده از API، ابتدا باید با استفاده از حساب های Github یا Google در وب‌سایت ما ثبت‌نام کنید. پس از ثبت‌نام، یک API Key منحصر‌به‌فرد دریافت خواهید کرد که برای ارسال درخواست‌ها به API الزامی است.",
  },
  {
    id: 2,
    question: "چگونه می‌توانم API Key دریافت کنم؟",
    answer:
      "بعد از ثبت نام با گیت هاب یا گوگل به صفحه get-api-key منتقل میشوید از آن جا میتوانید به Api-key خود دسترسی داشته باشید .",
  },
  {
    id: 3,
    question: "آیا استفاده از این API رایگان است؟",
    answer: "بله، این وب سرویس کاملا رایگان است.",
  },
  {
    id: 4,
    question: "آیا امکان دریافت لیست تمامی کشورها به زبان انگلیسی وجود دارد؟",
    answer:
      "بله، شما می‌توانید لیست تمامی کشورها را با زبان انگلیسی دریافت کنید.",
  },
  {
    id: 5,
    question: "داده‌های این وب سرویس آیا به‌روز می‌شوند؟",
    answer:
      "بله،داده های این وب سرویس مدام در حال به روز و افزایش اطلاعات کشورها میباشد.",
  },
  {
    id: 6,
    question: "چگونه می‌توانم مشکلات را گزارش دهم یا در توسعه API مشارکت کنم؟",
    answer:
      "شما می‌توانید مشکلات را در مخزن GitHub پروژه گزارش دهید یا Pull Request ارسال کنید.",
  },
];
